package com.example.nbank.enums;

public enum AccountType {
    SAVINGS,   // Сберегательный счет: предназначен для накопления средств, часто с начислением процентов
    CHECKING,  // Текущий счет: используется для ежедневных операций, таких как снятие наличных и оплата счетов
    LOAN,      // Кредитный счет: счет, на который начисляются заемные средства, которые нужно погасить
    DEPOSIT    // Депозитный счет: счет, на который внесен депозит на определенный срок с возможностью получения процентов

}
